{
    "Name": "Lesser Fae",
    "Keywords": ["CELTIC FAEBORN", "INFANTRY", "FAE"],
    "Points": 20,
    "Unit_Size": {
        "min": 5,
        "max": 20
    },
    "Move": 7,
    "Dash": 5,
    "Melee": 4,
    "Ranged": -1,
    "Strength": 5,
    "Durability": 5,
    "Health": 1,
    "Attacks": 1,
    "Will": 6,
    "Armour": 6,
    "Equipment_Options": "Models in this Formation are equipped with a Fae Claws and Celtic Daggers.",
    "Weapons": [{
        "Name": "Fae Claws",
        "Cost": 0,
        "Type": "Melee",
        "Range": "1",
        "Wound": "4",
        "Rend": "1",
        "Damage": "1",
        "Abilities": ["Serrated (1)"]
    }, {
        "Name": "Celtic Daggers",
        "Cost": 0,
        "Type": "Melee",
        "Range": "1",
        "Wound": "4",
        "Rend": "2",
        "Damage": "1",
        "Abilities": ["Additional Attacks (2)"]
    }],
    "Faction_Abilities": ["Master of Magic"],
    "Unit_Abilities": [{
        "Ability_Name": "Fae Magic",
        "Ability_Effect": " If this Formation has 1-10 Models then the Formation gains a Caster level of 1. If this Formation has 11-20 models then the Formation gains a Caster level of 2. This Formation may only use the Magic Spells listed in the Caster section to the right (In addition to Magic Blast and Mystic Touch)."
    }, {
        "Ability_Name": "Bloodthirsty Tricksters",
        "Ability_Effect": " At the start of the Magic Step, you may activate this Formations Thirst for Blood, if you do, then until the start of the next Magic Step, this Formation loses the ability to cast Magic Spells and does not get a magic pool and this model adds 1 to hit and wound rolls for attacks made in the Melee Combat Step."
    }],
    "Caster": "1/2",
    "Spells": [{
        "Name": "Sworn Protectors (25)",
        "Effect": " Select a friendly non-LEGENDARY Formation within 12\" of the caster and visible to it. Until the start of your next Magic Step, the selected Formation gains a Durability Characteristic of 6+ (if they already have a Durability Characteristic, improve it by 1 to a maximum of 5+)."
    }, {
        "Name": "Favoured Warrior (20)",
        "Effect": " Select a friendly non- LEGENDARY Formation within 9\" of the caster, until the start of the next Magic Step, the selected Formation may add re-roll failed hit rolls of 1 when making Melee Attacks."
    }]
}